app/controllers/bulletin_boards_controller.rb

SELECT "refrigerators".* FROM "refrigerators" WHERE ("refrigerators"."deadline" IS NOT NULL) AND (deadline < '2016-07-07 14:53:00.862019')
---
    def index
        #賞味期限が１週間以内に迫ってるやーつと買ってから1習慣経ってるやーつ
        @fridge1 = Refrigerator.where.not(deadline: nil).where("deadline < ?", 1.weeks.since)