app/controllers/donuts_controller.rb

  def index
    @donuts = Donut.all
---
SELECT "donuts".* FROM "donuts"

    def set_donut
      @donut = Donut.find(params[:id])
---
SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT 1  [["id", 1]]