app/controllers/refrigerators_controller.rb

  def index
    @refrigerators1 = Refrigerator.where.not(deadline: nil).order("deadline")
---
SELECT "refrigerators".* FROM "refrigerators" WHERE ("refrigerators"."deadline" IS NOT NULL)  ORDER BY deadline